#include <stdio.h>
#include <stdlib.h>
#include <conio.h>

int main()
{
    // оголошення змінних, які будуть використовуватися в програмі
    unsigned int variant; // 1 або 2 або 3 — допустимі значення, які може приймати змінна variant
    int N;
    int n;
    double start, delta, x;


    // виконуємо введення змінної variant
    // При введені недопустимих значень відбувається повторне введення
    // за допомогою циклу while()
    printf("Enter variant (1 or 2 or 3): ");
    scanf("%u", &variant); //

    // повторне введення варіанту, якщо введене значення не відповідає умові задачі — тобто
    // якщо введене значення більше 3 або менше 1.
    while( variant !=1  &&   variant !=2  &&   variant !=3  ){
        printf("ERROR. Invalid data\n");
        printf("Enter variant (1 or 2 or 3): ");
        scanf("%u", &variant);
    }



    printf("\n\nEnter N (N>=0): ");  // N = 0 -- exit;   N == 1 -- one row; N>1 --- ok
    scanf("%d", &N);

    while( N<0 ){
         printf("!!!!   N must be >= 0 !!!! \n");
         printf("N=");
         scanf("%d", &N);
    }


    if( N == 0 ){
         printf("\n\nBye-Bye!!!");  // прощальне повідомлення
         getch();                   // очікуємо натискання будь-якої клавіши перед виходом із програми
         exit(0);                   // завершення програми
    }
    else{

         // введення значення початку діапазону значень аргументу x
         printf("\n\nstart=");
         scanf("%lf", &start);

         // введення приросту аргументу. delta - приріст аргументу
         // якщо delta=0 --> повторне введення delta
         do{
            printf("delta=");
            scanf("%lf", &delta);
         }while( delta==0.0 && N>1  );


         if(N==1){
             // виводимо один рядок таблиці і надаємо коментарі
             system("cls"); // очищення екрану командного вікна від попередніх записів
             printf("Only one row \n"); // повідомляємо користувача, що він обрав випадок, коли в таблиці тільки один рядок
             printf("start=%.2lf\n", start);
             printf("+-----+---------------+");
             printf("\n");
             printf("|%5d|%15.2lf|", N, start*start );
             printf("\n");
             printf("+-----+---------------+");
         }
         else{
             // виводити велику таблицю
             system("cls");   // очищення екрану командного вікна від попередніх записів
             printf("start=%.2lf\n", start); // виводимо початкові дані перед побудовою таблиці
             printf("+-----+---------------+\n");

             x = start;

             // виведення таблиці
             for( n=1; n<=N ; n++ ){
                // printf("\n");
                printf("|%5d|%15.2lf|", n, x*x );
                printf("\n");
                printf("+-----+---------------+");
                printf("\n");
                x = x + delta;

                // затримка виведення після того, як буде відображено на екрані
                // чергова порція таблиці із 11 рядків. Для подовження виведення
                // треба натиснути будь-яку клавішу на клавіатурі
                if( n%11 == 0){
                    printf("Press any key\r");
                    getch();
                }
             }
         }
    }

    return 0;
}
